import pandas as pd

data = {
    'Имя': ['Алексей', 'Мария', 'Иван', 'Ольга', 'Дмитрий', 'Елена', 'Сергей', 'Анна', 'Павел', 'Юлия'],
    'Математика': [5, 4, 3, 5, 4, 5, 3, 4, 4, 5],
    'Физика': [4, 5, 4, 3, 4, 5, 5, 4, 3, 5],
    'Химия': [3, 4, 5, 4, 5, 3, 4, 4, 5, 4],
    'Биология': [5, 3, 4, 5, 3, 4, 5, 5, 4, 3],
    'Литература': [4, 5, 4, 3, 5, 4, 3, 4, 5, 5]
}

df = pd.DataFrame(data)
print(df.head())

print(f"Средняя оценка по Математике - {df['Математика'].mean()}")
print(f"Средняя оценка по Физике - {df['Физика'].mean()}")
print(f"Средняя оценка по Химии - {df['Химия'].mean()}")
print(f"Средняя оценка по Биологии - {df['Биология'].mean()}")
print(f"Средняя оценка по Литературе - {df['Литература'].mean()}")
print(f"Медианная оценка по Математике - {df['Математика'].median()}")
print(f"Медианная оценка по Физике - {df['Физика'].median()}")
print(f"Медианная оценка по Биологии - {df['Биология'].median()}")
print(f"Медианная оценка по Химии - {df['Химия'].median()}")
print(f"Медианная оценка по Литературе - {df['Литература'].median()}")

Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
IQR = Q3_math - Q1_math

print(df.describe())
print(f"Стандартное отклонение по Математике - {df['Математика'].std()}")
print(f"Стандартное отклонение по Физике - {df['Физика'].std()}")
print(f"Стандартное отклонение по Химии - {df['Химия'].std()}")
print(f"Стандартное отклонение по Биологии - {df['Биология'].std()}")
print(f"Стандартное отклонение по Литературе - {df['Литература'].std()}")